----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/yanhans/Documents/GitHub/Stats506_group/Stata_example/mtproject.log
  log type:  text
 opened on:  25 Nov 2020, 09:58:42

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. // install packages to help performing hl test
. net from https://www.sealedenvelope.com/
----------------------------------------------------------------------------------------------------------------------
https://www.sealedenvelope.com/
Programs from Sealed Envelope Ltd
----------------------------------------------------------------------------------------------------------------------

These programs are provided by Sealed Envelope Ltd.
For more details on their use visit www.sealedenvelope.com

PACKAGES you could -net describe-:
    hl                Hosmer-Lemeshow goodness of fit test
    mlogplot2         Extension to mlogplot to handle two-way interaction terms in mlogit
    reformat          Reformat regression output
    rescale           Rescale categorical variables using numbers found in value labels
    time              Convert strings in HH:MM:SS format to elapsed times and back again
    xcount            Count longitudinal data
    xfill             Fill in static variables in longitudinal data
    xtab              Tabulate longitudinal data
----------------------------------------------------------------------------------------------------------------------

. net describe hl

----------------------------------------------------------------------------------------------------------------------
package hl from https://www.sealedenvelope.com
----------------------------------------------------------------------------------------------------------------------

TITLE
      Hosmer-Lemeshow goodness of fit test

DESCRIPTION/AUTHOR(S)
      Calculate the Hosmer-Lemeshow C or H goodness of fit statistics for
      binary outcomes after logistic or probit regression or using external
      predictions. Optionally produce calibration plots.
      
      Author: Gareth Ambler, UCL.
      Distribution-Date: 25oct2012

INSTALLATION FILES                                   (type net install hl)
      stata/hl.ado
      stata/hl.hlp
----------------------------------------------------------------------------------------------------------------------

. net install hl
checking hl consistency and verifying not already installed...
all files already exist and are up to date.

. 
end of do-file

. use "/Users/yanhans/Documents/GitHub/Stats506_group/Stata_example/churn_data.dta"

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. import delimited ../data/Churn_Modelling_Cleaned.csv
no; data in memory would be lost
r(4);

end of do-file

r(4);

. clear

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. import delimited ../data/Churn_Modelling_Cleaned.csv
(11 vars, 10,000 obs)

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 creditscore |     10,000    650.5288     96.6533        350        850
   geography |          0
      gender |          0
         age |     10,000     38.9218    10.48781         18         92
      tenure |     10,000      5.0128    2.892174          0         10
-------------+---------------------------------------------------------
     balance |     10,000    76485.89    62397.41          0   250898.1
numofprodu~s |     10,000      1.5302    .5816544          1          4
   hascrcard |     10,000       .7055    .4558405          0          1
isactiveme~r |     10,000       .5151    .4997969          0          1
estimateds~y |     10,000    100090.2    57510.49      11.58   199992.5
-------------+---------------------------------------------------------
      exited |     10,000       .2037    .4027686          0          1

. 
end of do-file

. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 creditscore |     10,000    650.5288     96.6533        350        850
   geography |          0
      gender |          0
         age |     10,000     38.9218    10.48781         18         92
      tenure |     10,000      5.0128    2.892174          0         10
-------------+---------------------------------------------------------
     balance |     10,000    76485.89    62397.41          0   250898.1
numofprodu~s |     10,000      1.5302    .5816544          1          4
   hascrcard |     10,000       .7055    .4558405          0          1
isactiveme~r |     10,000       .5151    .4997969          0          1
estimateds~y |     10,000    100090.2    57510.49      11.58   199992.5
-------------+---------------------------------------------------------
      exited |     10,000       .2037    .4027686          0          1

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. save churn_data.dta, replace
file churn_data.dta saved

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. clear

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. use churn_data

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. encode geography, gen(geo)

. encode gender, gen(sex)

. logit exited creditscore i.geo i.sex age tenure balance numofproducts i.hascrcard i.isactivemember estimatedsalary

Iteration 0:   log likelihood = -5054.8913  
Iteration 1:   log likelihood =  -4331.648  
Iteration 2:   log likelihood =  -4280.834  
Iteration 3:   log likelihood = -4280.6777  
Iteration 4:   log likelihood = -4280.6777  

Logistic regression                             Number of obs     =     10,000
                                                LR chi2(11)       =    1548.43
                                                Prob > chi2       =     0.0000
Log likelihood = -4280.6777                     Pseudo R2         =     0.1532

----------------------------------------------------------------------------------
          exited |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
     creditscore |  -.0006683   .0002803    -2.38   0.017    -.0012178   -.0001189
                 |
             geo |
        Germany  |   .7747144    .067674    11.45   0.000     .6420758     .907353
          Spain  |   .0352178   .0706379     0.50   0.618      -.10323    .1736656
                 |
             sex |
           Male  |  -.5284828   .0544884    -9.70   0.000     -.635278   -.4216875
             age |    .072706   .0025755    28.23   0.000     .0676581    .0777539
          tenure |  -.0159491   .0093549    -1.70   0.088    -.0342843    .0023861
         balance |   2.64e-06   5.14e-07     5.13   0.000     1.63e-06    3.64e-06
   numofproducts |  -.1015227   .0471342    -2.15   0.031     -.193904   -.0091413
     1.hascrcard |  -.0446764   .0593395    -0.75   0.452    -.1609797    .0716269
1.isactivemember |  -1.075444   .0576856   -18.64   0.000    -1.188506    -.962382
 estimatedsalary |   4.81e-07   4.74e-07     1.01   0.310    -4.48e-07    1.41e-06
           _cons |  -3.392281   .2448081   -13.86   0.000    -3.872096   -2.912466
----------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. // perform an initial HL-test and generate HL plot
. predict p_exited
(option pr assumed; Pr(exited))

. hl exited p_exited, plot
 Group         N      Obs (%)        Exp (%)     Min %     Max %        HL
     1      1000     36 (3.6)     34.6 (3.5)       1.1       4.7      0.06
     2      1000     62 (6.2)     58.5 (5.9)       4.7       6.9      0.22
     3      1000     76 (7.6)     81.3 (8.1)       7.0       9.4      0.37
     4      1000    107 (10.7)    108.0 (10.8)     9.4      12.2      0.01
     5      1000    117 (11.7)    137.4 (13.7)    12.2      15.3      3.53
     6      1000    186 (18.6)    172.4 (17.2)    15.3      19.3      1.29
     7      1000    207 (20.7)    216.2 (21.6)    19.3      24.3      0.50
     8      1000    276 (27.6)    276.5 (27.7)    24.3      31.5      0.00
     9      1000    415 (41.5)    374.2 (37.4)    31.5      44.3      7.11
    10      1000    555 (55.5)    577.8 (57.8)    44.3      93.1      2.14
 Total      10000  2037 (20.4)    2037.0 (20.4)    1.1      93.1     15.22

       number of observations =     10000
             number of groups =        10
      Hosmer-Lemeshow chi2(10) =        15.22
                  Prob > chi2 =         0.1242

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     10,000 -5054.891  -4280.678      12    8585.355   8671.879
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. logit exited creditscore i.geo i.sex age tenure balance numofproducts i.isactivemember estimatedsalary

Iteration 0:   log likelihood = -5054.8913  
Iteration 1:   log likelihood = -4331.8642  
Iteration 2:   log likelihood = -4281.1165  
Iteration 3:   log likelihood = -4280.9604  
Iteration 4:   log likelihood = -4280.9604  

Logistic regression                             Number of obs     =     10,000
                                                LR chi2(10)       =    1547.86
                                                Prob > chi2       =     0.0000
Log likelihood = -4280.9604                     Pseudo R2         =     0.1531

----------------------------------------------------------------------------------
          exited |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
     creditscore |  -.0006658   .0002803    -2.37   0.018    -.0012152   -.0001163
                 |
             geo |
        Germany  |   .7738109   .0676596    11.44   0.000     .6412005    .9064212
          Spain  |   .0356738   .0706365     0.51   0.614    -.1027711    .1741188
                 |
             sex |
           Male  |  -.5286243   .0544867    -9.70   0.000    -.6354163   -.4218324
             age |   .0727131   .0025753    28.23   0.000     .0676656    .0777606
          tenure |  -.0161217   .0093519    -1.72   0.085    -.0344511    .0022078
         balance |   2.65e-06   5.14e-07     5.15   0.000     1.64e-06    3.65e-06
   numofproducts |  -.1015726   .0471296    -2.16   0.031    -.1939449   -.0092003
1.isactivemember |  -1.074639   .0576697   -18.63   0.000    -1.187669   -.9616079
 estimatedsalary |   4.81e-07   4.74e-07     1.02   0.310    -4.47e-07    1.41e-06
           _cons |  -3.425475   .2408563   -14.22   0.000    -3.897545   -2.953406
----------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     10,000 -5054.891   -4280.96      11    8583.921   8663.234
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. logit exited creditscore i.geo i.sex age tenure balance numofproducts i.isactivemember

Iteration 0:   log likelihood = -5054.8913  
Iteration 1:   log likelihood = -4332.3339  
Iteration 2:   log likelihood = -4281.6325  
Iteration 3:   log likelihood = -4281.4763  
Iteration 4:   log likelihood = -4281.4763  

Logistic regression                             Number of obs     =     10,000
                                                LR chi2(9)        =    1546.83
                                                Prob > chi2       =     0.0000
Log likelihood = -4281.4763                     Pseudo R2         =     0.1530

----------------------------------------------------------------------------------
          exited |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
     creditscore |  -.0006682   .0002803    -2.38   0.017    -.0012176   -.0001188
                 |
             geo |
        Germany  |   .7740589   .0676575    11.44   0.000     .6414526    .9066652
          Spain  |   .0358646   .0706252     0.51   0.612    -.1025583    .1742874
                 |
             sex |
           Male  |  -.5291178   .0544817    -9.71   0.000       -.6359   -.4223356
             age |   .0726845   .0025748    28.23   0.000     .0676381    .0777309
          tenure |  -.0159542     .00935    -1.71   0.088    -.0342798    .0023715
         balance |   2.65e-06   5.14e-07     5.16   0.000     1.65e-06    3.66e-06
   numofproducts |  -.1007193   .0471245    -2.14   0.033    -.1930816   -.0083571
1.isactivemember |  -1.075352   .0576665   -18.65   0.000    -1.188376   -.9623277
           _cons |  -3.376667   .2359405   -14.31   0.000    -3.839102   -2.914232
----------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     10,000 -5054.891  -4281.476      10    8582.953   8655.056
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. predict np_exited
(option pr assumed; Pr(exited))

. hl exited p_exited, plot
 Group         N      Obs (%)        Exp (%)     Min %     Max %        HL
     1      1000     36 (3.6)     34.6 (3.5)       1.1       4.7      0.06
     2      1000     62 (6.2)     58.5 (5.9)       4.7       6.9      0.22
     3      1000     76 (7.6)     81.3 (8.1)       7.0       9.4      0.37
     4      1000    107 (10.7)    108.0 (10.8)     9.4      12.2      0.01
     5      1000    117 (11.7)    137.4 (13.7)    12.2      15.3      3.53
     6      1000    186 (18.6)    172.4 (17.2)    15.3      19.3      1.29
     7      1000    207 (20.7)    216.2 (21.6)    19.3      24.3      0.50
     8      1000    276 (27.6)    276.5 (27.7)    24.3      31.5      0.00
     9      1000    415 (41.5)    374.2 (37.4)    31.5      44.3      7.11
    10      1000    555 (55.5)    577.8 (57.8)    44.3      93.1      2.14
 Total      10000  2037 (20.4)    2037.0 (20.4)    1.1      93.1     15.22

       number of observations =     10000
             number of groups =        10
      Hosmer-Lemeshow chi2(10) =        15.22
                  Prob > chi2 =         0.1242

. 
end of do-file

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. predict np_exited
variable np_exited already defined
r(110);

end of do-file

r(110);

. do "/var/folders/mn/f5ms8m0j1g521clck63zsyp40000gn/T//SD93567.000000"

. logit exited i.geo i.sex age tenure  numofproducts i.hascrcard i.isactivemember

Iteration 0:   log likelihood = -5054.8913  
Iteration 1:   log likelihood = -4345.6609  
Iteration 2:   log likelihood = -4297.4455  
Iteration 3:   log likelihood =  -4297.291  
Iteration 4:   log likelihood =  -4297.291  

Logistic regression                             Number of obs     =     10,000
                                                LR chi2(8)        =    1515.20
                                                Prob > chi2       =     0.0000
Log likelihood =  -4297.291                     Pseudo R2         =     0.1499

----------------------------------------------------------------------------------
          exited |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
             geo |
        Germany  |   .9155013    .062202    14.72   0.000     .7935875    1.037415
          Spain  |   .0336919     .07044     0.48   0.632     -.104368    .1717518
                 |
             sex |
           Male  |  -.5194436   .0543434    -9.56   0.000    -.6259546   -.4129325
             age |   .0724064    .002569    28.18   0.000     .0673712    .0774416
          tenure |  -.0156638   .0093341    -1.68   0.093    -.0339584    .0026307
   numofproducts |  -.1674469   .0456337    -3.67   0.000    -.2568873   -.0780065
     1.hascrcard |  -.0494851   .0592231    -0.84   0.403    -.1655602    .0665901
1.isactivemember |  -1.076774   .0575737   -18.70   0.000    -1.189617   -.9639318
           _cons |  -3.492484   .1485067   -23.52   0.000    -3.783552   -3.201416
----------------------------------------------------------------------------------

. estat ic

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
           . |     10,000 -5054.891  -4297.291       9    8612.582   8677.475
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
end of do-file

